XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/pdm_reg.h
    /* 0xC04 : audpdm_itf */
    union {
        struct {
            uint32_t adc_0_en       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t adc_1_en       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t adc_2_en       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_12  : 10; /* [12: 3],       rsvd,        0x0 */
            uint32_t aud_rx0_sel    : 3;  /* [15:13],        r/w,        0x0 */
            uint32_t aud_rx1_sel    : 3;  /* [18:16],        r/w,        0x1 */
            uint32_t aud_rx2_sel    : 3;  /* [21:19],        r/w,        0x2 */
            uint32_t reserved_22_29 : 8;  /* [29:22],       rsvd,        0x0 */
            uint32_t adc_itf_en     : 1;  /* [   30],        r/w,        0x0 */
            uint32_t reserved_31    : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audpdm_itf;

    /* 0xC08 : pdm_adc_0 */
    union {
        struct {
            uint32_t adc_0_fir_mode : 1;  /* [    0],        r/w,        0x0 */
            uint32_t adc_1_fir_mode : 1;  /* [    1],        r/w,        0x0 */
            uint32_t adc_2_fir_mode : 1;  /* [    2],        r/w,        0x0 */
            uint32_t adc_0_scal     : 6;  /* [ 8: 3],        r/w,       0x20 */
            uint32_t adc_1_scal     : 6;  /* [14: 9],        r/w,       0x20 */
            uint32_t adc_2_scal     : 6;  /* [20:15],        r/w,       0x20 */
            uint32_t reserved_21_31 : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_adc_0;

    /* 0xC0C : pdm_adc_1 */
    union {
        struct {
            uint32_t adc_0_k1       : 4; /* [ 3: 0],        r/w,        0x8 */
            uint32_t adc_0_k1_en    : 1; /* [    4],        r/w,        0x1 */
            uint32_t adc_0_k2       : 4; /* [ 8: 5],        r/w,        0xd */
            uint32_t adc_0_k2_en    : 1; /* [    9],        r/w,        0x0 */
            uint32_t adc_1_k1       : 4; /* [13:10],        r/w,        0x8 */
            uint32_t adc_1_k1_en    : 1; /* [   14],        r/w,        0x1 */
            uint32_t adc_1_k2       : 4; /* [18:15],        r/w,        0xd */
            uint32_t adc_1_k2_en    : 1; /* [   19],        r/w,        0x0 */
            uint32_t adc_2_k1       : 4; /* [23:20],        r/w,        0x8 */
            uint32_t adc_2_k1_en    : 1; /* [   24],        r/w,        0x1 */
            uint32_t adc_2_k2       : 4; /* [28:25],        r/w,        0xd */
            uint32_t adc_2_k2_en    : 1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_adc_1;

    /* 0xC10 : pdm_dac_0 */
    union {
        struct {
            uint32_t adc_pdm_h          : 6;  /* [ 5: 0],        r/w,        0x1 */
            uint32_t adc_pdm_l          : 6;  /* [11: 6],        r/w,       0x3f */
            uint32_t reserved_12        : 1;  /* [   12],       rsvd,        0x0 */
            uint32_t adc_0_pdm_lvl_swap : 1;  /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15     : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t adc_1_pdm_lvl_swap : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_18     : 2;  /* [18:17],       rsvd,        0x0 */
            uint32_t adc_2_pdm_lvl_swap : 1;  /* [   19],        r/w,        0x0 */
            uint32_t reserved_20_31     : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_dac_0;

    /* 0xc14  reserved */
    uint8_t RESERVED0xc14[8];

    /* 0xC1C : pdm_pdm_0 */
    union {
        struct {
            uint32_t pdm_0_en       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t pdm_1_en       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t pdm_2_en       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t adc_0_pdm_sel  : 3;  /* [ 5: 3],        r/w,        0x0 */
            uint32_t adc_1_pdm_sel  : 3;  /* [ 8: 6],        r/w,        0x1 */
            uint32_t adc_2_pdm_sel  : 3;  /* [11: 9],        r/w,        0x2 */
            uint32_t reserved_12_31 : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_pdm_0;

    /* 0xC20 : pdm_rsvd0 */
    union {
        struct {
            uint32_t rsvd0 : 32; /* [31: 0],        r/w,     0xffff */
        } BF;
        uint32_t WORD;
    } pdm_rsvd0;

    /* 0xC24 : pdm_dbg_0 */
    union {
        struct {
            uint32_t reserved_0_20     : 21; /* [20: 0],       rsvd,        0x0 */
            uint32_t adc_test_clkin_en : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22       : 1;  /* [   22],       rsvd,        0x0 */
            uint32_t adc_test_din_en   : 1;  /* [   23],        r/w,        0x0 */
            uint32_t aud_test_read_sel : 6;  /* [29:24],        r/w,        0x0 */
            uint32_t reserved_30_31    : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_dbg_0;

    /* 0xC28 : pdm_dbg_1 */
    union {
        struct {
            uint32_t aud_test_read : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_dbg_1;

    /* 0xC2C : pdm_dbg_2 */
    union {
        struct {
            uint32_t adc_fir_4s_val    : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t adc_0_fir_4s_en   : 1;  /* [   20],        r/w,        0x0 */
            uint32_t adc_1_fir_4s_en   : 1;  /* [   21],        r/w,        0x0 */
            uint32_t adc_2_fir_4s_en   : 1;  /* [   22],        r/w,        0x0 */
            uint32_t adc_in_0_test_sel : 1;  /* [   23],        r/w,        0x0 */
            uint32_t adc_in_1_test_sel : 1;  /* [   24],        r/w,        0x0 */
            uint32_t adc_in_2_test_sel : 1;  /* [   25],        r/w,        0x0 */
            uint32_t reserved_26_31    : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_dbg_2;

    /* 0xC30 : pdm_dbg_3 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_dbg_3;

