XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/pdm_reg.h
    /* 0xC34 : pdm_dbg_4 */
    union {
        struct {
            uint32_t adc_in_ratio_4s_val     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t adc_in_ch0_ratio_4s_val : 1;  /* [    1],        r/w,        0x0 */
            uint32_t adc_in_ch1_ratio_4s_val : 1;  /* [    2],        r/w,        0x0 */
            uint32_t adc_in_ch2_ratio_4s_val : 1;  /* [    3],        r/w,        0x0 */
            uint32_t pdm_in_ratio_4s_val     : 1;  /* [    4],        r/w,        0x0 */
            uint32_t pdm_in_ratio_4s         : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31           : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_dbg_4;

    /* 0xC38 : pdm_adc_s0 */
    union {
        struct {
            uint32_t adc_s0_volume : 9;  /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_31 : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_adc_s0;

    /* 0xC3C : pdm_adc_s1 */
    union {
        struct {
            uint32_t adc_s1_volume : 9;  /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_31 : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_adc_s1;

    /* 0xC40 : pdm_adc_s2 */
    union {
        struct {
            uint32_t adc_s2_volume : 9;  /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_31 : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_adc_s2;

    /* 0xc44  reserved */
    uint8_t RESERVED0xc44[60];

    /* 0xC80 : pdm_rx_fifo_ctrl */
    union {
        struct {
            uint32_t rx_fifo_flush  : 1; /* [    0],        w1c,        0x0 */
            uint32_t rxo_int_en     : 1; /* [    1],        r/w,        0x0 */
            uint32_t rxu_int_en     : 1; /* [    2],        r/w,        0x0 */
            uint32_t rxa_int_en     : 1; /* [    3],        r/w,        0x0 */
            uint32_t rx_drq_en      : 1; /* [    4],        r/w,        0x0 */
            uint32_t rx_data_res    : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rx_ch_en       : 3; /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11_13 : 3; /* [13:11],       rsvd,        0x0 */
            uint32_t rx_drq_cnt     : 2; /* [15:14],        r/w,        0x0 */
            uint32_t rx_trg_level   : 6; /* [21:16],        r/w,       0x17 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rx_data_mode   : 2; /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_rx_fifo_ctrl;

    /* 0xC84 : pdm_rx_fifo_status */
    union {
        struct {
            uint32_t reserved_0     : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t rxo_int        : 1;  /* [    1],          r,        0x0 */
            uint32_t rxu_int        : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3     : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t rxa_int        : 1;  /* [    4],          r,        0x0 */
            uint32_t reserved_5_15  : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t rxa_cnt        : 6;  /* [21:16],          r,        0x0 */
            uint32_t reserved_22_23 : 2;  /* [23:22],       rsvd,        0x0 */
            uint32_t rxa            : 1;  /* [   24],          r,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_rx_fifo_status;

    /* 0xC88 : pdm_rx_fifo_data */
    union {
        struct {
            uint32_t rx_data : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } pdm_rx_fifo_data;
};

typedef volatile struct pdm_reg pdm_reg_t;

#endif /* __PDM_REG_H__ */
